{
  "BodyBeat": "This is the parameter on which almost every other parameter depends. It's basically how many frames it takes for the character to do an step.\n\nTIPS: 12f is the normal walking rhythm for a human but changing the beat is a great way of starting to iterate on a new walk.",
  "ArmsBeat": "The arms beat is similar to the body beat but with the arms swinging. It's basically how many frames it takes for the arm to do a full arc.\n\nTIPS: Normally, the arms beat matches the body beat, but feel free to experiment with offsetting both beats.",
  "UpDown": "This parameter represents how much the character moves in the Y-axis. This vertical motion is a result of our body being affected by gravity and falling to the ground before the forward foot catches the body in time to push it up again.\n\nTIPS: as a general rule, women tend to make shorter steps along a straight line. This results in way less movement in the Y-axis, as opposed to men.",
  "BodyTilt": "This parameter represents how much the character's trunk is tilted forward (rotated in the X-axis).\n\nTIPS: When we walk we tend to tilt forward as a result of our moving direction. However, certain attitudes (e.g. cocky) might cause the opposite effect on the body.",
  "HeadUpDown": "This parameter is the same as the general Up & Down but only affecting the head. That's because the head has an overlapping action in regard to the main body.\n\nTIPS: a lot of up and down in the head is caused when the body has a lot of up and down as well",
  "HeadPigeon": "This is the parameter that controls the head Z-axis movement. It's called pigeon because that's the most characteristics head movement of pigeons and it's not very common in human beings.\n\nTIPS: this parameter is meant to break the rules and add more variation to the character. In fact, Richard Williams advises to not move the head back and forth to avoid this pigeon effect. Unless, of course, you want that.",
  "HeadEgoist": "This is the parameter that controls the head Z-axis rotation. It's called egoist because this rotation is often seen in cocky people or people who like to be on camera all the time.\n\nTIPS: to better convey this feeling of self-love (i.e floating head effect) there should be little up and down in the body.",
  "HeadNodding": "This parameter refers to the almost inevitable head X-rotation that happens as a consequence of our body bouncing on the ground.\n\nTIPS: this parameter is really useful for loosening up the head and convey a more confindent and relaxed feeling in the character.",
  "HeadTilt": "This parameter refers to how much the character's head is tilted (backward=0 or forward=1 in the slider) in general as a constant thing during the walking cycle. A character's head can still nod but can be tilted forward at the same time.\n\nTIPS: this parameter is really useful for conveying the emotional state of the character (e.g head tilted forward means sad).",
  "FaceExpression": "This parameter is quite straightforward. It allows to change the character's facial expression (5 different options).\n\nTIPS: use this parameter to emphasize the character’s emotional state.",
  "BackCurvature": "This parameter refers to the amount of hump of the character.\n\nTIPS: If you want the character to feel tired you might augment its back curvature. Or if you want the character to be brazen he/she might have his/her back curvature inverted, showing his/her chest in a cocky way. This last example would work great with the egoist head parameter.",
  "PelvisYRotation": "This parameter represents the Y-rotation of the pelvis. It rotates to favor the front leg (the one supporting the weight) and the extremes are between the pass and up positions.\n\nTIP: This rotation is normally subtle but exaggerating  it can result in funny walk cycles.",
  "PelvisWeightShift": "This parameter represents the weight shift of the body, that favors the leg that's supporting the body weight at that moment. This results in an X-axis movement of the character's pelvis.\n\nTIPS: if you want the character to feel heavy, this is a good way of achieving it.",
  "ChestYRotation": "The chest rotation counterbalances the Y-axis rotation of the pelvis. It rotates in the opposite direction.\n\nTIPS: if the chest rotation is high it might be a good idea to reflect that in the elbows drag as well.",
  "ChestUpDown": "The chest also has some Y-axis movement, although it's a bit delayed. This causes some squash and stretch in the upper body.\n\nTIPS: usually this movement is very subtle and it’s used to give a more organic feel to the body. But exaggerating it can result in some funny and interesting walk cycles.",
  "TailSwing": "This parameter represents the amount of swaying of the tail along the Y-axis.\n\nTIPS: this parameter is useful for conveying strong emotions like happiness or anger (high swinging) or more calmed emotions like sadness (low swinging).",
  "TailCurl": "This parameter represents how much the tail is curled.\n\nTIPS: this comes in handy to reflect the character's tension in the body.",
  "TailTilt": "This parameter represents the inclination of the tail.\n\nTIPS: as a general rule, the tail is higher when the character is really happy or angry and lower if he/she is tired or sad.",
  "TailWaving": "This parameter represents how much wavy movement (X-rotation) the tail has.\n\nTIPS: this parameter is useful for loosening up the character and make him/her feel more relaxed.",
  "ArmsSwing": "This parameter controls the amount of swinging in the arms.\n\nTIPS: a person tends to have a wider arc in the arm movement when he/she has a lot of energy, otherwise the arms tend to have less swinging.",
  "ArmsWidth": "This parameter controls the distance between the trunk and the arms.\n\nTIPS: a person tends to have the arms closer to the body when he/she is not confident, is scared or too tired. When we are scared or intimidated for example we usually have our extremities closer to our body as a defense mechanism to protect our vital organs.",
  "ElbowsDrag": "Because the forearm is separated from the upper arm by a joint, this part has some delay respect to the upper arm, which is the one that leads the arm movement. This delay is called drag and this parameter controls how much drag is caused by the elbow in the forearm.\n\nTIPS: as a general rule, a heavy arm with a lot of swinging will have a lot of drag in the forearm as well.",
  "HandsDrag": "This parameter controls the drag of the hands. The hands have the same drag effect as the elbow but with the wrist instead.\n\nTIPS: in general, the hand drag is subtler but it's always interesting to try different things to achieve original walks.",
  "HandsPose": "This parameter has two options (Relaxed and Fist) for posing the hands. This adds a bit of variation and makes the hands to have some impact in the character emotional/physical state.\n\nTIPS: try to think what the character is feeling to choose the right hand pose.",
  "LegsSeparation": "This parameter controls how open the legs are in the X-axis.\n\nTIPS: this separation has the same effect as with the arms separation from the trunk (more space indicates more confidence).",
  "FeetYRotation": "This parameter controls the Y-axis rotation of the feet.\n\nTIPS: more opened feet indicates confidence while the opposite indicates lack of self-confidence. Rotating the feet in unnatural ways it's not always bad. For example, Richard Williams explains in his book that Art Babbitt was famous for inventing the walk of the Goofy character, and he went as far as rotating his feet backwards. Remember animation is all about breaking the rules!",
  "StepDistance": "This parameter controls the distance of each step during the walking cycle.\n\nTIPS: more distance is normally a sign of more confident steps, while sorter steps indicate lack of self-confidence. A longer step also stretches the leg and gives the walking a more cartoon style.",
  "SettingsQuality": "This parameter lets you choose the rendering quality of the viewport. If you have performance issues try setting it to Low.",
  "SettingsSilhouette": "Mark the checkbox to see the character in flat black as if it was just a silhouette. This is really useful to identify the key poses of the animation without being distracted by the details of the model. If you are having performance issues this option can also help.",
  "SettingsPlayblast": "Click apply to generate a playblast AVI file of 4 seconds with 100 quality. You'll find all the generated files in the /movies folder of this Maya project."
}